app/controllers/school_classes_controller.rb

   def create
    @school_class = SchoolClass.create(params.require(:school_class))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-08-14 19:00:19.834595"], ["updated_at", "2018-08-14 19:00:19.834595"]]